<?
header("Cache-control: no-store");
header("Expires: " . date("r"));

/* Директива no-store является самым категоричным запретом на кэширование. 
Официальная спецификация определяет ее следующим образом:

Директива «no-store» указывает на то, что в кэше не должны сохраняться части ни запроса, ни ответа. 
Эта директива применяется как для частного, так и для публичного кэша.
*/
?>

<html>
<head>
	<title>Запрет кеширования</title>
</head>

<body>
<h1>Запрет кеширования</h1>
<h1><?=date("H:i:s")?></h1>

</body>
</html>
 