<?
header("Cache-control: max-age=3600"); //Заголовок Cache-Control определяет количество времени, которое файл должен находиться в кэше, и метод кэширования.
header("Expires: " . date("r", time() + 600)); //При применении max-age для определения времени, которое файл должен храниться в кэше, следует учитывать тип этого файла и то, как он используется.

/*
Если браузер видит, что файл должен храниться в течение пяти минут, 
он будет оставаться в кэше браузера в течение этого времени. 
И этот файл не должен обновляться при его повторном вызове.
*/
?>

<html>
<head>
	<title>Разрешение кеширования</title>
</head>

<body>
<h1>Разрешение кеширования</h1>
<h1><?=date("H:i:s")?></h1>

</body>
</html>